<!DOCTYPE html>
<html lang="da">
<head>
    <meta charset="utf-8">
</head>

<body>
    
    <div>
        <header>
            <link rel="stylesheet" type="text/css" href="design.css">
        </header>


        <h1>Identitet og Form&aring;l</h1>
        <h2>1.1 Identitet</h2>
        <h2>1.2 Form&aring;l</h2>

        <p>
            Programmering er et fagfelt der kan udvikle elevernes innovative og skabende kompetencer.
            Det handler ikke bare om, at eleverne skal kunne programmere. Det handler ogs&aring; om
            at kunne t&aelig;nke selv, kunne samarbejde omkring idéudvikling, skabelse og videndeling.
            Hermed er programmering ogs&aring; med til at udvikle elevernes digitale- og studiekompetencer.
            Programmering kan medvirke til at skabe interesse for teknologi og it, nationalt og globalt,
            og dermed ogs&aring; bidrage til elevernes karrierekompetencer, samtidig med at de bliver
            introduceret til abstrakt t&aelig;nkning, logisk opbygning og probleml&oslash;sning.
            Blandt de faglige m&aring;l indg&aring;r, at eleverne skal kunne:<br /><br />

            <li>
                demonstrere viden om fagets identitet og metoder,<br /></li>
            <span>
                l&oslash;se en enkelt problemstilling gennem udviklingen af et program bl.a. i samspil med andre
                fag.<br /><br />
            </span>

            Dette betyder, at der ikke alene undervises i programmering, men ogs&aring; om programmering.<br />
            N&aring;r faget indg&aring;r i et samarbejde med andre fag, uanset om det er i studieomr&aring;det (SO), stu-<br />
            dieomr&aring;deprojektet (SOP) p&aring; hhx/htx eller studieretningsopgaven (SRO), studieretningspro-<br />
            jektet (SRP) p&aring; stx, st&oslash;rre skriftlige opgave (SSO) p&aring; hf eller det er et fagligt samarbejde i en<br />
            studieretning, s&aring; skal eleverne kunne inddrage og anvende relevante programmerings-<br />
            m&aelig;ssige metoder, redeg&oslash;re for disse i et sprog, som man ogs&aring; uden for faget kan forst&aring;,<br />
            samt forholde sig til fagets muligheder og begr&aelig;nsninger i arbejdet med den konkrete pro-<br />
            blemstilling.
            I l&aelig;replanens afsnit 1.1 og 1.2 er der givet en kompakt beskrivelse af fagets identitet og af det overordnede form&aring;l med undervisningen.
            <br /><br /><br />
</div>

    <div style="text-align:center" class="centreButtons">
        <a href="Index.html" class="button"</a><button>Forige side</button>
        <a href="Index.html" class="button"</a><button >Indholdsfortegnelse</button>
        <a href="Faglige-mål--faglig-inhold.html" class="button"</a><button >N&aelig;ste side</button>        
    </div>

</body>
</html>
